import 'package:ui_13/data/plant_model.dart';

List<Plants> plants = [
  Plants(
    id: 0,
    name: 'พลูด่าง',
    imagePath: 'assets/images/image1.jpg',
    category: 'Office',
    description:
        'เป็นพืชไม้เลื้อยที่ปลูกง่ายมาก และใช้เวลาในการเจริญเติบโตไม่นาน นอกจากนี้ยังสามารถดูดซับก๊าซคาร์บอนไดออกไซด์ได้มากถึง 75% และยังสามารถคายก๊าซออกซิเจนในเวลากลางวัน ได้ถึง 100% ',
    price: 75.00,
    isFavorit: false,
  ),
  Plants(
    id: 1,
    name: 'เยอบีร่า',
    imagePath: 'assets/images/image2.jpg',
    category: 'Office',
    description:
        'เยอบีร่าเป็นไม้ประดับที่มีขนาดเล็กและออกดอกสวยงาม เหมาะกับการนำมาประดับตกแต่งห้องต่าง ๆ ภายในบ้านหรือคอนโด ซึ่งนอกจากจะให้ความสวยงามแบบเฉพาะตัวแล้ว ยังเป็นต้นไม้ฟอกอากาศ ช่วยดูดก๊าซคาร์บอนไดออกไซด์ ทำให้อากาศสดชื่นตลอดวัน ',
    price: 75.00,
    isFavorit: false,
  ),
  Plants(
    id: 2,
    name: 'กล้วยไม้',
    imagePath: 'assets/images/image3.jpg',
    category: 'Office',
    description:
        'กล้วยไม้นอกจากจะขึ้นชื่อเรื่องความสวยงามแล้ว ยังมีความพิเศษกว่าต้นไม้ชนิดอื่นตรงที่เป็นต้นไม้ฟอกอากาศด้วย โดยกล้วยไม้มีความสามารถในการดูดก๊าซคาร์บอนไดออกไซด์ได้อย่างมีประสิทธิภาพและสามารถคายก๊าซออกซิเจนได้ ',
    price: 60.00,
    isFavorit: false,
  ),
  Plants(
    id: 3,
    name: 'เดหลี',
    imagePath: 'assets/images/image5.jpg',
    category: 'Office',
    description:
        'ที่มีจุดเด่นทั้งเรื่องกลิ่นหอมและยังมีดอกสวยงาม โดยต้นเดหลีเหมาะจะเป็นต้นไม้ฟอกอากาศที่นำมาปลูกในบ้านเนื่องจากมีความสามารถในการดูดซับสารพิษในบ้านได้ด้วย โดยช่วยดูดสารพิษประเภทกาว อะซิโตนซึ่งมีอยู่ในเครื่องสำอาง น้ำยาทาเล็บ น้ำยาลบคำผิด สารไตรคลอโรเอทีลีน ',
    price: 90.00,
    isFavorit: false,
  ),
  Plants(
    id: 4,
    name: 'ว่านหางจระเข้',
    imagePath: 'assets/images/image6.jpg.jpg',
    category: 'Office',
    description:
        'ที่มีจุดเด่นทั้งเรื่องกลิ่นหอมและยังมีดอกสวยงาม โดยต้นเดหลีเหมาะจะเป็นต้นไม้ฟอกอากาศที่นำมาปลูกในบ้านเนื่องจากมีความสามารถในการดูดซับสารพิษในบ้านได้ด้วย โดยช่วยดูดสารพิษประเภทกาว อะซิโตนซึ่งมีอยู่ในเครื่องสำอาง น้ำยาทาเล็บ น้ำยาลบคำผิด สารไตรคลอโรเอทีลีน ',
    price: 90.00,
    isFavorit: false,
  ),
  Plants(
    id: 5,
    name: 'ว่านหางจระเข้',
    imagePath: 'assets/images/image7.jpg',
    category: 'Office',
    description:
        'อีกชื่อหนึ่งคือหอกพระอินทร์ เป็นอีกหนึ่งไม้ประดับที่ปลูกและดูแลรักษาได้ง่าย รวมทั้งยังมีคุณประโยชน์หลากหลาย เนื่องจากเป็นพืชที่คายก๊าซออกซิเจนในเวลากลางคืน แต่จะคายก๊าซคาร์บอนไดออกไซด์ในตอนกลางวัน จึงเหมาะสำหรับการปลูกในห้องนอน ',
    price: 90.00,
    isFavorit: false,
  ),
];

List<Plants> populerPlants = [
  Plants(
    id: 0,
    name: 'เยอบีร่า',
    imagePath: 'assets/images/image2.jpg',
    category: 'Office',
    description:
        'เยอบีร่าเป็นไม้ประดับที่มีขนาดเล็กและออกดอกสวยงาม เหมาะกับการนำมาประดับตกแต่งห้องต่าง ๆ ภายในบ้านหรือคอนโด ซึ่งนอกจากจะให้ความสวยงามแบบเฉพาะตัวแล้ว ยังเป็นต้นไม้ฟอกอากาศ ช่วยดูดก๊าซคาร์บอนไดออกไซด์ ทำให้อากาศสดชื่นตลอดวัน ',
    price: 75.00,
    isFavorit: false,
  ),
  Plants(
    id: 1,
    name: 'เบญจมาศ',
    imagePath: 'assets/images/image.png',
    category: 'Office',
    description:
        'จุดเด่นของเบญจมาศคือเป็นต้นไม้ฟอกอากาศที่เป็นมลพิษ อย่างกลิ่นจากสีทาบ้าน กาว พลาสติก และผงซักฟอก ให้กลายเป็นอากาศบริสุทธิ์ได้ ',
    price: 75.00,
    isFavorit: false,
  ),
  Plants(
    id: 2,
    name: 'เศรษฐีเรือนใน',
    imagePath: 'assets/images/03.png',
    category: 'Office',
    description:
        'เศรษฐีเรือนในเป็นไม้ประดับที่มักนิยมปลูกในบ้านเนื่องจากเชื่อว่าเป็นสิริมงคล เสริมโชคลาภและป้องกันภัยให้กับผู้อยู่อาศัย นอกจากนี้ยังขึ้นชื่อเรื่องการเป็นต้นไม้ฟอกอากาศ ',
    price: 60.00,
    isFavorit: false,
  ),
];
